# WireSizeString Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..WireSizeString Property
ElectricalSystem Class See Also
---
The WireSize as a String of the Electrical System
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string WireSizeString { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WireSizeString As String
	Get
```

Visual C++
---
```text
public:
property String^ WireSizeString {
	String^ get ();
}
```

# Remarks
This property is used to retrieve the WireSize String of the Electrical System.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | This property only available when System Type is Power! |

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace